hw/hw6/p2/app/views/pics/user.html.erb

    <script type="text/javascript">
    //<![CDATA[
	   new Tag ("<%= 'tag' + tag.id.to_s %>", "<%= 'image' + photo.id.to_s %>",  <%= tag.left_x %>, <%= tag.top_y %>, <%= tag.width %>, <%= tag.height %>, "<%= User.find(tag.user_id).first_name + " " + User.find(tag.user_id).last_name %>");
    //]]>
---
SELECT "tags".* FROM "tags" WHERE ("tags".photo_id = 12)
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1