hw/hw6/p2/app/views/pics/users.html.erb

<tr>
<td><a href= "<%="user/" +  user.id.to_s %>"><%= user.first_name + " " + user.last_name %><a/></td>
---
SELECT "users".* FROM "users" LIMIT 10