hw/hw6/p2/app/controllers/pics_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def user
    $id = params[:id]
    @user = User.find($id)

SELECT "photos".* FROM "photos" WHERE ("photos"."id" = 5) LIMIT 1
---
  def comment
       @id = params[:id]
       @photo = Photo.find(@id)

SELECT "photos".* FROM "photos" WHERE ("photos"."id" = 5) LIMIT 1
INSERT INTO "comments" ("comment", "created_at", "date_time", "photo_id", "updated_at", "user_id") VALUES ('hahuhiha', '2012-05-18 03:25:07.587471', '2012-05-18 03:25:07', 5, '2012-05-18 03:25:07.587471', 3)
---
  def post_comment
     @id    = session["photo_id"]
     @photo = Photo.find(@id)
     @comment = Comment.create(:comment=>params[:comment][:comment],:photo_id =>@id, :user_id=> session[:id], :date_time=>DateTime.now)

SELECT "photos".* FROM "photos" WHERE ("photos"."id" = 6) LIMIT 1
SELECT "tags".* FROM "tags" WHERE ("tags".photo_id = 10)
INSERT INTO "tags" ("height", "left_x", "photo_id", "timestamps", "top_y", "user_id", "width") VALUES (100, 272, 6, NULL, 17, 7, 100)
SELECT "users".* FROM "users" WHERE ("users"."id" = 7) LIMIT 1
---
  def post_tag
     @photo_id = params[:tag][:tag_photo_id]
     @photo = Photo.find(@photo_id)
     @tag = Tag.create(:left_x=>params[:tag][:left_x], :top_y=>params[:tag][:top_y], :height=>params[:tag][:height], :width=>params[:tag][:width],:photo_id =>@photo_id, :user_id=> params[:tag][:user_id])
     if @tag.valid?
        @tag.save
        flash[:message]="Your tags have been saved"
        redirect_to :action=> :user, :id=>session["id"].to_s
     else
        @user = User.find(session["id"])

INSERT INTO "photos" ("created_at", "date_time", "file_name", "updated_at", "user_id") VALUES ('2012-05-16 03:59:39.161751', '2012-05-16 03:59:39.000000', 'selome_timnit.jpg', '2012-05-16 03:59:39.161751', 3)
---
  def post_photo
     if !params[:photo].nil?
       if Photo.create(:file_name=>params[:photo][:photo].original_filename, :user_id=> session[:id], :date_time=>DateTime.now).valid?