hw/hw6/p2/app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."login" = 'obama') LIMIT 1
---
  def post_login
    @user = User.find_by_login(params[:user][:login])

INSERT INTO "users" ("created_at", "first_name", "last_name", "login", "password_digest", "salt", "updated_at") VALUES ('2012-05-20 21:12:55.598628', 'a', 'a', 'a', '86f7e437faa5a7fce15d1ddcb9eaeaea377667b8', 0, '2012-05-20 21:12:55.598628')
SELECT "users"."id" FROM "users" WHERE ("users"."login" = 'a') AND ("users".id <> 7) LIMIT 1
---
  def post_register
     @user = User.create(:first_name=>params[:user][:first_name], :last_name=>params[:user][:last_name], :login=>params[:user][:login], :password=>params[:user][:password], :password_confirmation=>params[:user][:password_confirmation])
     if @user.valid?
         @user.save
         session["name"]= @user.first_name